#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`

Show Plan

```terraform
[0m[1mmodule.cloudflare_setup.data.cloudflare_zone.lilja_dot_io: Reading...[0m[0m
[0m[1mmodule.cloudflare_setup.data.cloudflare_zone.lilja_dot_io: Read complete after 1s [id=801ec7bc35b2abc9580d847c7b5c6f56][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.mx_proton_mail: Refreshing state... [id=6a0c264f84eebecec606e8d26c26a424][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.mx_proton_mailsec: Refreshing state... [id=92ed20e9c1228ea46c74ea80d1505566][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.mx_proton_spf1: Refreshing state... [id=63d176ec8068198506fb92d83af88bee][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.cname_dkim2: Refreshing state... [id=fccded21c489eb0af1be2b60b8146d9c][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.cname_dkim3: Refreshing state... [id=fbb831323bced8e857c178d8df4ebadb][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.cname_dkim1: Refreshing state... [id=9677ec4eac251f1da60d2a6b945d7d48][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.mx_proton_protomain_verification: Refreshing state... [id=5a64b437361c0d87c612affbabf5a1b5][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.cloudflare_setup.cloudflare_record.txt_dmarc[0m will be created
[0m  [32m+[0m[0m resource "cloudflare_record" "txt_dmarc" {
      [32m+[0m[0m allow_overwrite = false
      [32m+[0m[0m created_on      = (known after apply)
      [32m+[0m[0m hostname        = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metadata        = (known after apply)
      [32m+[0m[0m modified_on     = (known after apply)
      [32m+[0m[0m name            = "_dmarc"
      [32m+[0m[0m proxiable       = (known after apply)
      [32m+[0m[0m proxied         = false
      [32m+[0m[0m ttl             = (known after apply)
      [32m+[0m[0m type            = "TXT"
      [32m+[0m[0m value           = "v=DMARC1; p=quarantine"
      [32m+[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m```



*Pusher: @jlilja, Action: `pull_request`, Workflow: `Plan Terraform code on PR`*